Hey this still seems to occur in `v1.3.7`

```
...
- Installing megaport/megaport v1.3.7...
- Installed megaport/megaport v1.3.7 (self-signed, key ID C6F2DC9F50135458)
...

   # module.private_vxc["3"].megaport_vxc.private_vxc will be updated in-place
  ~ resource "megaport_vxc" "private_vxc" {
      ~ a_end                = {
          ~ current_product_uid   = "428bbb5a-92b4-470d-bcf8-c4fdd5f2fbfe" -> (known after apply)
          ~ location              = "5GN Melbourne Data Centre (MDC)" -> (known after apply)
          ~ location_id           = 23 -> (known after apply)
          + ordered_vlan          = (known after apply)
          ~ product_name          = "Firewall (Cyan) - (Staging) - BLUE zone - mel-mdc" -> (known after apply)
          ~ requested_product_uid = "428bbb5a-92b4-470d-bcf8-c4fdd5f2fbfe" -> "0a60aaa5-65b6-46a6-9117-668081d14762"
          ~ vlan                  = 999 -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "00c6b158-a621-4f0d-95b0-d839e172e1c8" -> (known after apply)
          ~ location              = "5GN Melbourne Data Centre (MDC)" -> (known after apply)
          ~ location_id           = 23 -> (known after apply)
          + ordered_vlan          = (known after apply)
          ~ product_name          = "Router (Cyan) - (Staging) - BLUE zone - mel-mdc" -> (known after apply)
          ~ vlan                  = 1279 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Thursday, 10-Jul-25 14:00:00 UTC" -> (known after apply)
      ~ contract_start_date  = "Tuesday, 10-Jun-25 22:48:36 UTC" -> (known after apply)
      ~ create_date          = "Tuesday, 10-Jun-25 22:47:39 UTC" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ last_updated         = "Tuesday, 10-Jun-25 22:48:13 UTC" -> (known after apply)
      ~ live_date            = "Tuesday, 10-Jun-25 22:48:36 UTC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (20 unchanged attributes hidden)
    }

...

Error: Error Updating VXC
  with module.private_vxc["3"].megaport_vxc.private_vxc,
  on virtual-cross-connect/private/main.tf line 1, in resource "megaport_vxc" "private_vxc":
   1: resource "megaport_vxc" "private_vxc" {
Could not update VXC with ID 524f5893-56a9-4aa7-8380-e07d6e6adb68: PUT
https://api-staging.megaport.com/v3/product/vxc/524f5893-56a9-4aa7-8380-e07d6e6adb68:
400 (trace_id "7f4d2e5325b78cdcdc6af0087c402920") Can't move VXC. aVnicIndex
null is invalid. Valid range is 0 to 4 

```